// 7) Модифицируйте предыдущий пример – учтите вариант, если пользователь не передал параметр в функцию.
//  В таком случае выведите сообщение – “Введите возраст”.
//   Реализуйте два вида проверки наличия аргумента – проверка на undefined и оператор ||.

// function age(a) {
//     if (a === undefined) {
//         a = prompt("Введите возраст")
//     }
//     if (a > 16) {
//         alert("Добро пожаловать")
//     } else {
//         alert("вы еще молоды")
//     }
// }

// console.log(age(14));
//
//  оператор ||.

