// 8) Дана строка. Сделайте заглавным первый символ каждого слова этой строки.
// Для этого сделайте вспомогательную функцию ucfirst, которая будет получать строку,
// делать первый символ этой строки заглавным и возвращать обратно строку с заглавной первой буквой.

// let str = "володя употребляет мясо";
// function ucfirst(str1) {
//     let arr = str1.split(" ");
//     for (let i = 0; i < arr.length; i++) {
//         arr[i] = arr[i][0].toUpperCase() + arr[i].slice(1);
//     }
//     return arr.join(" ")
// }
// console.log(ucfirst(str));
